artillery.yml
config:
  target: 'http://localhost:7686'
  phases:
    - duration: 60
      arrivalRate: 10
  defaults:
    headers:
      content-type: application/json

scenarios:
  - name: Get all todos
    flow:
      - get:
          url: '/todos'
          expect:
            - statusCode: 200

  - name: Create, update, and delete todo
    flow:
      - post:
          url: '/todos'
          json:
            text: 'New Todo Item'
          expect:
            - statusCode: 201
          capture:
            - json: "$.id"
              as: "todoId"
      
      - put:
          url: '/todos/{{ todoId }}'
          json:
            text: 'Updated Todo Item'
            completed: true
          expect:
            - statusCode: 200

      - delete:
          url: '/todos/{{ todoId }}'
          expect:
            - statusCode: 204